## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:23" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:23" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 23 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "cd041a88bbf1d8d2ea39e1eaf7a75835-6" -> "c6fcf8c8c1afe27b80e4cd51c54b9fd9"
        id                     = "graphql.c6fcf8c8c1afe27b80e4cd51c54b9fd9.zip"
        tags                   = {}
      ~ version_id             = "Jvb.sNhCEZNkbUB0JBNRj1YdwD1tkNRz" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "999331e5e93e3e2b985cfffb76d5b6e2" -> "8538e576004cc66a45af905bb670580e"
        id                     = "dist/200.html"
      ~ source_hash            = "999331e5e93e3e2b985cfffb76d5b6e2" -> "8538e576004cc66a45af905bb670580e"
        tags                   = {}
      ~ version_id             = "evsNDS5gNip73m.DvKSwBoUtYAn55Rap" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "25f53ae7f4be4da23b74305d281858b3" -> "19d531ba2d38665b5ba2913f57575eb8"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "25f53ae7f4be4da23b74305d281858b3" -> "19d531ba2d38665b5ba2913f57575eb8"
        tags                   = {}
      ~ version_id             = "2bfZJ.fu_7DYjQac9vTELgpks3UPCeCp" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "aa0afefe8473f1ed5288ca6cde9ec21a" -> "e3f545c5a29d3bbdd7df8df39c03ea7d"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "aa0afefe8473f1ed5288ca6cde9ec21a" -> "e3f545c5a29d3bbdd7df8df39c03ea7d"
        tags                   = {}
      ~ version_id             = "gstps1lrzvAeeoFVvZwt11aLIoj6XSXh" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "999331e5e93e3e2b985cfffb76d5b6e2" -> "8538e576004cc66a45af905bb670580e"
        id                     = "dist/index.html"
      ~ source_hash            = "999331e5e93e3e2b985cfffb76d5b6e2" -> "8538e576004cc66a45af905bb670580e"
        tags                   = {}
      ~ version_id             = "OHwB7CAxMp6eMSfOX6gGPS5kTokzY_1t" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/css/app.82d2eb99.css"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/css"
+       etag                   = "25ae8e22dc499378622fd7adf19f8460"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/css/app.82d2eb99.css"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/css/app.82d2eb99.css"
+       source_hash            = "25ae8e22dc499378622fd7adf19f8460"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/css/app.d91da6a7.css"] will be destroyed
  # (because key ["static/css/app.d91da6a7.css"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/css" -> null
-       etag                   = "585f6fef58bbe4705979830098ad9e82" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/css/app.d91da6a7.css" -> null
-       key                    = "dist/static/css/app.d91da6a7.css" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/css/app.d91da6a7.css" -> null
-       source_hash            = "585f6fef58bbe4705979830098ad9e82" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "PjjLfvDute2QfA7TatGB.iNYzgQBt2cG" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/1.2bd6f191.chunk.js"] will be destroyed
  # (because key ["static/js/1.2bd6f191.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c53f8af00d1bf863d53ebdd383555705" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/1.2bd6f191.chunk.js" -> null
-       key                    = "dist/static/js/1.2bd6f191.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/1.2bd6f191.chunk.js" -> null
-       source_hash            = "c53f8af00d1bf863d53ebdd383555705" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "JWG8PWrfMcoFH01AldJ3uNmPwFGk2Rqj" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/1.2bd6f191.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/1.2bd6f191.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "fff832de01eb9de482aea2f882eb271d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/1.2bd6f191.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/1.2bd6f191.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/1.2bd6f191.chunk.js.LICENSE.txt" -> null
-       source_hash            = "fff832de01eb9de482aea2f882eb271d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Qc2jX2btAlrd3VNEpK8tcc1QuDCaJJao" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/233.d266196c.chunk.js"] will be destroyed
  # (because key ["static/js/233.d266196c.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "60a9aa452ef98b7962c3c504bbbe1734" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/233.d266196c.chunk.js" -> null
-       key                    = "dist/static/js/233.d266196c.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/233.d266196c.chunk.js" -> null
-       source_hash            = "60a9aa452ef98b7962c3c504bbbe1734" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "dWda1z2eNqrhruM1nTuLQ3cx94FuIO3p" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/233.d266196c.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/233.d266196c.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b0b9d6c66b18ac480194b45244c2082e" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/233.d266196c.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/233.d266196c.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/233.d266196c.chunk.js.LICENSE.txt" -> null
-       source_hash            = "b0b9d6c66b18ac480194b45244c2082e" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "qhWqu8.Ft5w8MAMS2adZMXvaHb.0Bp9Y" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.641e9f0e.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyAgenciesPage.641e9f0e.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "dce0f5b73edc36013e878e2af2297bdd" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgenciesPage.641e9f0e.chunk.js" -> null
-       key                    = "dist/static/js/AgencyAgenciesPage.641e9f0e.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.641e9f0e.chunk.js" -> null
-       source_hash            = "dce0f5b73edc36013e878e2af2297bdd" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Q8AutvrjVi8eKGRq1KoPv8ggp9EvK2O9" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.641e9f0e.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyAgenciesPage.641e9f0e.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "bcde97539f3625abd638d02589951efb" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgenciesPage.641e9f0e.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyAgenciesPage.641e9f0e.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.641e9f0e.chunk.js.LICENSE.txt" -> null
-       source_hash            = "bcde97539f3625abd638d02589951efb" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "XRfeqivAiVXB1bzJVUmKZAYpRhDU7Gof" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.90843d4e.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "7332d47cb0345623fc16ec92df33e5aa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgenciesPage.90843d4e.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.90843d4e.chunk.js"
+       source_hash            = "7332d47cb0345623fc16ec92df33e5aa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.90843d4e.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "55d3003fc652eef3fccd962d62d4f328"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgenciesPage.90843d4e.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.90843d4e.chunk.js.LICENSE.txt"
+       source_hash            = "55d3003fc652eef3fccd962d62d4f328"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.7663501d.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "1f75e27d78015e06ed74c86a1e441676"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyEditAgencyPage.7663501d.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.7663501d.chunk.js"
+       source_hash            = "1f75e27d78015e06ed74c86a1e441676"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.7663501d.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "330ee0ebe4f567a6b50a756956869310"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyEditAgencyPage.7663501d.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.7663501d.chunk.js.LICENSE.txt"
+       source_hash            = "330ee0ebe4f567a6b50a756956869310"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "cbe411fdc09e6d95c5fd23882ba788d6" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js" -> null
-       key                    = "dist/static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js" -> null
-       source_hash            = "cbe411fdc09e6d95c5fd23882ba788d6" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "oD2xEu1snyPHiJFRCvD4JLDuWZug3M6u" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "1e0c57567747bddd0ca98c61ae7be577" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js.LICENSE.txt" -> null
-       source_hash            = "1e0c57567747bddd0ca98c61ae7be577" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "0Mtp7admtbWsMp4rUGpYaeyUhIueLPxE" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.5add27d4.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyNewAgencyPage.5add27d4.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "89fc1842690bbeb4b39eb788d68273c0" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyNewAgencyPage.5add27d4.chunk.js" -> null
-       key                    = "dist/static/js/AgencyNewAgencyPage.5add27d4.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.5add27d4.chunk.js" -> null
-       source_hash            = "89fc1842690bbeb4b39eb788d68273c0" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "64S2GcSsNmZ9VktujaEWAuymKTZfnz7e" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.5add27d4.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyNewAgencyPage.5add27d4.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "bff59781626ae53e91d0da1b84ebe35e" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyNewAgencyPage.5add27d4.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyNewAgencyPage.5add27d4.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.5add27d4.chunk.js.LICENSE.txt" -> null
-       source_hash            = "bff59781626ae53e91d0da1b84ebe35e" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "SWAFGG23q5Uj8ewwVQJb8aYaCUjwPysJ" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "32aa396eb2a809c72e86036c7754bb7e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js"
+       source_hash            = "32aa396eb2a809c72e86036c7754bb7e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "2dbbc8114432eec3779954ec28b87eb4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.e3dcd37e.chunk.js.LICENSE.txt"
+       source_hash            = "2dbbc8114432eec3779954ec28b87eb4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.6d515f9d.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "a6b36db5d237305f365a2ae2e9565ba9"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/LoginPage.6d515f9d.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.6d515f9d.chunk.js"
+       source_hash            = "a6b36db5d237305f365a2ae2e9565ba9"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "0cb98b03c5f49de681bca973ccc95978"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt"
+       source_hash            = "0cb98b03c5f49de681bca973ccc95978"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.54afd531.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "ed744eeae4e8a781269a95b38a33a4f2"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationEditOrganizationPage.54afd531.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.54afd531.chunk.js"
+       source_hash            = "ed744eeae4e8a781269a95b38a33a4f2"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.54afd531.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "8a0b38f7baa36897e72772f56e87a38f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationEditOrganizationPage.54afd531.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.54afd531.chunk.js.LICENSE.txt"
+       source_hash            = "8a0b38f7baa36897e72772f56e87a38f"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js"] will be destroyed
  # (because key ["static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "06704eeb39b71daf9467b718e7e4f076" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js" -> null
-       key                    = "dist/static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js" -> null
-       source_hash            = "06704eeb39b71daf9467b718e7e4f076" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "1trDqI2z_9RRvchV0PU8NEvGLQ3Pf5iv" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "89bec65d8ddbf829fc049240d15672b4" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js.LICENSE.txt" -> null
-       source_hash            = "89bec65d8ddbf829fc049240d15672b4" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "8nBE621A090Aa8uklChM_y4qDSUbGlZl" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js"] will be destroyed
  # (because key ["static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "5aede0957941092de9aff46b97976b47" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js" -> null
-       key                    = "dist/static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js" -> null
-       source_hash            = "5aede0957941092de9aff46b97976b47" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "dAK7f9tqlYAF9HupT0ywT3cdZDWpMpH9" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "30a505666a7dadc1be936949bdb251f4" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js.LICENSE.txt" -> null
-       source_hash            = "30a505666a7dadc1be936949bdb251f4" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "DKKA1BNOAQ3ctgrIDWYmByI.z3LS22yw" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "7418fcbef4a3521e97e10eb4b11a1bcb"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js"
+       source_hash            = "7418fcbef4a3521e97e10eb4b11a1bcb"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "2a1e1a838077413f775b16b619b654f8"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js.LICENSE.txt"
+       source_hash            = "2a1e1a838077413f775b16b619b654f8"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationsPage.07f257d5.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "a141f1480467875e0c668e60ee663952"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationOrganizationsPage.07f257d5.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationsPage.07f257d5.chunk.js"
+       source_hash            = "a141f1480467875e0c668e60ee663952"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationsPage.07f257d5.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "ed5f295167ceab5c497248391619c11e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationOrganizationsPage.07f257d5.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationsPage.07f257d5.chunk.js.LICENSE.txt"
+       source_hash            = "ed5f295167ceab5c497248391619c11e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationsPage.f6e94fe4.chunk.js"] will be destroyed
  # (because key ["static/js/OrganizationOrganizationsPage.f6e94fe4.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "8a7130f374311efaa1be38e49e6f223d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationOrganizationsPage.f6e94fe4.chunk.js" -> null
-       key                    = "dist/static/js/OrganizationOrganizationsPage.f6e94fe4.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationsPage.f6e94fe4.chunk.js" -> null
-       source_hash            = "8a7130f374311efaa1be38e49e6f223d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "d5EAfMuAzhX3T0Df5GTAAHbp1tarEqFD" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationsPage.f6e94fe4.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/OrganizationOrganizationsPage.f6e94fe4.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "007dbe1c43f985dcda028acffbe7e3d3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationOrganizationsPage.f6e94fe4.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/OrganizationOrganizationsPage.f6e94fe4.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationsPage.f6e94fe4.chunk.js.LICENSE.txt" -> null
-       source_hash            = "007dbe1c43f985dcda028acffbe7e3d3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "XVEazYBT942YDM8vZeo3VOlFPN3psH0a" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodsPage.8bd8f9f0.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "bdaf2b7c3af59b575ec2ca926250312d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/ReportingPeriodsPage.8bd8f9f0.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodsPage.8bd8f9f0.chunk.js"
+       source_hash            = "bdaf2b7c3af59b575ec2ca926250312d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodsPage.8bd8f9f0.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9880be41514116a4ea92e571bebc1840"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/ReportingPeriodsPage.8bd8f9f0.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodsPage.8bd8f9f0.chunk.js.LICENSE.txt"
+       source_hash            = "9880be41514116a4ea92e571bebc1840"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodsPage.c74f996d.chunk.js"] will be destroyed
  # (because key ["static/js/ReportingPeriodsPage.c74f996d.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "5d365c06cb0003e61b2dd4cd6d15f64f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/ReportingPeriodsPage.c74f996d.chunk.js" -> null
-       key                    = "dist/static/js/ReportingPeriodsPage.c74f996d.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodsPage.c74f996d.chunk.js" -> null
-       source_hash            = "5d365c06cb0003e61b2dd4cd6d15f64f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "B0yodEVcJ5bJAY2gBklq2fDDVnVZioFY" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodsPage.c74f996d.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/ReportingPeriodsPage.c74f996d.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "9880be41514116a4ea92e571bebc1840" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/ReportingPeriodsPage.c74f996d.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/ReportingPeriodsPage.c74f996d.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodsPage.c74f996d.chunk.js.LICENSE.txt" -> null
-       source_hash            = "9880be41514116a4ea92e571bebc1840" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "rdqX9e9HFpYOTuGu1ytP46mcJWe4VlwC" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.8918e825.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.8918e825.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "0d7b3728ac94b02fe76b85b13006fa37" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.8918e825.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadsPage.8918e825.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.8918e825.chunk.js" -> null
-       source_hash            = "0d7b3728ac94b02fe76b85b13006fa37" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "gYBRheCsHIqIDcRC8ih7f9uxbHKnvMJu" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.8918e825.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.8918e825.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "0e50bfdec334b0b61743676533950bba" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.8918e825.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadsPage.8918e825.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.8918e825.chunk.js.LICENSE.txt" -> null
-       source_hash            = "0e50bfdec334b0b61743676533950bba" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "j81K5JK2b_GefdOndnjtTxf1PTQgVtPa" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.8b5be2b7.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "7cc1d8b6808269af108b8716dfbd48b6"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.8b5be2b7.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.8b5be2b7.chunk.js"
+       source_hash            = "7cc1d8b6808269a...*[Comment body truncated]*